/*
	학번 : 202511227
	이름 : 이승훈
	프로그램 명 : c언어 ch08 - 예제 코드 6번
	날짜 : 2025.09.21
*/

/*
    예제 8-6 : '포인터 + 정수' 연산의 결과
*/

#include <stdio.h>

// 원래는 원칙적으로 절대 주소를 사용하지 않는다. 컴파일러가 실행마다 할당 해주는 주소가 다르기 때문
// 그렇기에 변수명 앞에 엠퍼센트(주소구하기 연산자) 사용

int main()
{
    int* p = (int*)0x100;       // 포인터 연산을 확인하기 위해 절대 주소를 대입한다.
    double* q = (double*)0x100;
    char* r = (char*)0x100;

    printf("int*   : %p, %p, %p\n", p, p + 1, p + 2);   // 4바이트씩 차이
    printf("double*: %p, %p, %p\n", q, q + 1, q + 2);   // 8바이트씩 차이
    printf("char*  : %p, %p, %p\n", r, r + 1, r + 2);   // 1바이트씩 차이

    return 0;
}