/*
	학번 : 202511227
	이름 : 이승훈
	프로그램 명 : c언어 ch08 - 예제 코드 4번
	날짜 : 2025.09.21
*/

/*
    예제 8-4 : 포인터가 필요한 경우
*/

#include <stdio.h>

// 포인터 사용에는 교과서에 크게 2가지 있던데 좀 더 자세하게는 (수업 내용 포함)
// 이진트리 구조 -> 자료 구조 구현
// 그래프 인접 리스트 표현
// 함수 포인터
// 문자열 등 많은 곳에서 쓰인다

void test1(int x)    // 매개변수 x는 main의 x로 초기화된 지역 변수
{
    x = 20;          // x는 test1의 지역 변수이므로 test1이 리턴될 때 소멸된다.
}

void test2(int* p)   // p는 main의 x의 주소로 초기화된 포인터이다.
{
    *p = 20;         // p가 가리키는 변수, 즉 main의 x에 20을 대입한다.
}

int main()
{
    int x = 10;
    test1(x);   // main의 x를 함수의 매개변수 x로 복사해서 전달한다.
    printf("test1 호출 후 x = %d\n", x);   // x의 값은 변경되지 않는다.

    test2(&x);  // test2 함수를 호출할 때 x의 주소를 넘겨준다.
    printf("test2 호출 후 x = %d\n", x);   // x의 값이 변경된다.

    return 0;
}