/*
	학번 : 202511227
	이름 : 이승훈
	프로그램 명 : c언어 ch08 - 예제 코드 11번
	날짜 : 2025.09.21
*/

/*
    예제 8-11 : 포인터 배열의 선언 및 사용
*/

#include <stdio.h>

/*
    포인터 배열이냐 배열의 포인터이냐 구분 잘하기
    교수님 코딩 테스트 np 나와있던 문제, -> 그리고 추가로 함수도 주소가 있고 담아서 쓸수 있음 (연계)
*/

int main()
{
    int a, b, c, d, e;
    int* arr[5] = { &a, &b, &c, &d, &e };   // 포인터 배열
    int i;

    for (i = 0; i < 5; i++)
    {
        *arr[i] = i;                        // arr[i]는 포인터이다.
        printf("%d ", *arr[i]);
    }
    printf("\n");

    return 0;
}