/*
	학번 : 202511227
	이름 : 이승훈
	프로그램 명 : c언어 ch07 - 예제 코드 8번
	날짜 : 2025.09.15
*/

/*
	예제 7-8 : 배열의 비교
*/

#include <stdio.h>

int main()
{
	int x[5] = { 10,20,30,40,50 };
	int y[5] = { 10,20,30,40,50 };
	int i;
	int is_equal;

	if (x == y)
		printf("두 배열의 주소가 같습니다.\n");
	/*
		기본적으로 다른 곳에 할당된 배열은 두 주소가 같을 수 없다.
	*/
	is_equal = 1;

	for (i = 0; i < 5; i++)
	{
		if (x[i] != y[i])
		{
			is_equal = 0;
			break;
		}
	}

	if (is_equal == 1)
		printf("두 배열의 내용이 같습니다");

	/*
		is equal 편의상 상태 변수를 하나 설정 후, 값이 같은 경우 상태유지
		같지 않으면 상태 바꿔서 break 후 같지 않는 분기 실행
		약간 토클 스위치 같음.
	*/
	return 0;
}